app/controllers/games_controller.rb

SELECT "games".* FROM "games" ORDER BY "games"."score" DESC, "games"."initials" ASC
---
  def index
    @games = Game.all.order(score: :desc, initials: :asc)

INSERT INTO "games" ("initials", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["initials", "cgk"], ["score", 1800], ["created_at", "2017-10-09 14:50:37.596039"], ["updated_at", "2017-10-09 14:50:37.596039"]]
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "games" SET "likes" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["likes", 1], ["updated_at", "2017-10-19 15:28:55.381488"], ["id", 4]]
---
  def update
    @game = Game.find(params[:id])
    @game.likes +=1
    @game.save